# Pandas tutorial

In [1]:
# how to install library
pip install pandas

SyntaxError: invalid syntax (473572486.py, line 2)

- Import library

In [2]:
import pandas as pd
import numpy as np

In [3]:
# object creation
s = pd.Series([1,3,5,np.nan,7,8,9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    7.0
5    8.0
6    9.0
dtype: float64

In [4]:
# series of dates
dates = pd.date_range("20220101",periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2022-01-01 -0.888522 -1.946848  1.974426  2.502181
2022-01-02  0.649916 -0.780348 -0.656050  0.611396
2022-01-03  1.916040 -0.016785  0.191226  0.726365
2022-01-04  1.240771 -0.932199 -0.240157  0.288054
2022-01-05 -0.973054  0.571700  0.322663  1.700305
2022-01-06 -1.483692 -0.799128  0.741622  0.048412

In [6]:
df2=pd.DataFrame(
    
    {
    "A":1.0,
    "B":pd.Timestamp("20220201"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([3]*4,dtype="int32"),
    "E": pd.Categorical(["girl","women","girl","women"]),
    "F":"females",    
        
    }
)
df2

     A          B    C  D      E        F
0  1.0 2022-02-01  1.0  3   girl  females
1  1.0 2022-02-01  1.0  3  women  females
2  1.0 2022-02-01  1.0  3   girl  females
3  1.0 2022-02-01  1.0  3  women  females

In [7]:
print(df2.dtypes)

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
#to view data
df2.head()

     A          B    C  D      E        F
0  1.0 2022-02-01  1.0  3   girl  females
1  1.0 2022-02-01  1.0  3  women  females
2  1.0 2022-02-01  1.0  3   girl  females
3  1.0 2022-02-01  1.0  3  women  females

In [9]:
df2.tail(3)  # last 3 rows

     A          B    C  D      E        F
1  1.0 2022-02-01  1.0  3  women  females
2  1.0 2022-02-01  1.0  3   girl  females
3  1.0 2022-02-01  1.0  3  women  females

In [10]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# converting data frame to array(numpy)
df.to_numpy()

array([[-0.88852157, -1.94684837,  1.97442555,  2.50218061],
       [ 0.64991641, -0.78034774, -0.65604988,  0.61139606],
       [ 1.91604042, -0.01678516,  0.19122555,  0.72636502],
       [ 1.24077073, -0.93219936, -0.24015722,  0.28805445],
       [-0.97305431,  0.57169966,  0.32266258,  1.70030466],
       [-1.4836916 , -0.79912782,  0.74162173,  0.04841238]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2022-02-01 00:00:00'), 1.0, 3, 'girl', 'females'],
       [1.0, Timestamp('2022-02-01 00:00:00'), 1.0, 3, 'women',
        'females'],
       [1.0, Timestamp('2022-02-01 00:00:00'), 1.0, 3, 'girl', 'females'],
       [1.0, Timestamp('2022-02-01 00:00:00'), 1.0, 3, 'women',
        'females']], dtype=object)

In [13]:
df.describe

<bound method NDFrame.describe of                    A         B         C         D
2022-01-01 -0.888522 -1.946848  1.974426  2.502181
2022-01-02  0.649916 -0.780348 -0.656050  0.611396
2022-01-03  1.916040 -0.016785  0.191226  0.726365
2022-01-04  1.240771 -0.932199 -0.240157  0.288054
2022-01-05 -0.973054  0.571700  0.322663  1.700305
2022-01-06 -1.483692 -0.799128  0.741622  0.048412>

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.076910 -0.650601  0.388955  0.979452
std    1.380961  0.859557  0.913170  0.936239
min   -1.483692 -1.946848 -0.656050  0.048412
25%   -0.951921 -0.898931 -0.132312  0.368890
50%   -0.119303 -0.789738  0.256944  0.668881
75%    1.093057 -0.207676  0.636882  1.456820
max    1.916040  0.571700  1.974426  2.502181

- to take transpose of data

In [15]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-02-01 00:00:00,2022-02-01 00:00:00,2022-02-01 00:00:00,2022-02-01 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,girl,women,girl,women
F,females,females,females,females

- sorting data

In [16]:
 df.sort_index(axis=1,ascending=False)
# df.sort_index(axis=1,ascending=True)

                   D         C         B         A
2022-01-01  2.502181  1.974426 -1.946848 -0.888522
2022-01-02  0.611396 -0.656050 -0.780348  0.649916
2022-01-03  0.726365  0.191226 -0.016785  1.916040
2022-01-04  0.288054 -0.240157 -0.932199  1.240771
2022-01-05  1.700305  0.322663  0.571700 -0.973054
2022-01-06  0.048412  0.741622 -0.799128 -1.483692

In [17]:
df.sort_values(by= "C")

                   A         B         C         D
2022-01-02  0.649916 -0.780348 -0.656050  0.611396
2022-01-04  1.240771 -0.932199 -0.240157  0.288054
2022-01-03  1.916040 -0.016785  0.191226  0.726365
2022-01-05 -0.973054  0.571700  0.322663  1.700305
2022-01-06 -1.483692 -0.799128  0.741622  0.048412
2022-01-01 -0.888522 -1.946848  1.974426  2.502181

- filtering or sorting by specific column

In [18]:
df["D"]

2022-01-01    2.502181
2022-01-02    0.611396
2022-01-03    0.726365
2022-01-04    0.288054
2022-01-05    1.700305
2022-01-06    0.048412
Freq: D, Name: D, dtype: float64

- Row wise selection

In [19]:
df[0:0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [20]:
df[0:1]

                   A         B         C         D
2022-01-01 -0.888522 -1.946848  1.974426  2.502181

- select by laels

In [21]:
# row wise
df.loc[dates[3]]

A    1.240771
B   -0.932199
C   -0.240157
D    0.288054
Name: 2022-01-04 00:00:00, dtype: float64

In [22]:
# column wise
df.loc[:,["A","B"]]

                   A         B
2022-01-01 -0.888522 -1.946848
2022-01-02  0.649916 -0.780348
2022-01-03  1.916040 -0.016785
2022-01-04  1.240771 -0.932199
2022-01-05 -0.973054  0.571700
2022-01-06 -1.483692 -0.799128

In [23]:
# data from 2 to 4
df.loc["20220102":"20220104"],["A","B"]

(                   A         B         C         D
 2022-01-02  0.649916 -0.780348 -0.656050  0.611396
 2022-01-03  1.916040 -0.016785  0.191226  0.726365
 2022-01-04  1.240771 -0.932199 -0.240157  0.288054,
 ['A', 'B'])

In [24]:
# data of 2 and 4
df.loc[["20220102","20220104"],["A","B"]]

                   A         B
2022-01-02  0.649916 -0.780348
2022-01-04  1.240771 -0.932199

In [25]:
df.loc["20220102",["A","B","C"]]

A    0.649916
B   -0.780348
C   -0.656050
Name: 2022-01-02 00:00:00, dtype: float64

In [26]:
df.at[dates[3],"A"]

1.2407707294827945

In [27]:
df.iloc[3]

A    1.240771
B   -0.932199
C   -0.240157
D    0.288054
Name: 2022-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[0:4]#rows = 0 , columns = 4

                   A         B         C         D
2022-01-01 -0.888522 -1.946848  1.974426  2.502181
2022-01-02  0.649916 -0.780348 -0.656050  0.611396
2022-01-03  1.916040 -0.016785  0.191226  0.726365
2022-01-04  1.240771 -0.932199 -0.240157  0.288054

### boolean operators

In [29]:
df[df["A"]>0]

                   A         B         C         D
2022-01-02  0.649916 -0.780348 -0.656050  0.611396
2022-01-03  1.916040 -0.016785  0.191226  0.726365
2022-01-04  1.240771 -0.932199 -0.240157  0.288054

In [30]:
df[df["A"]<0] # values less thn 0 in column A

                   A         B         C         D
2022-01-01 -0.888522 -1.946848  1.974426  2.502181
2022-01-05 -0.973054  0.571700  0.322663  1.700305
2022-01-06 -1.483692 -0.799128  0.741622  0.048412

In [31]:
df[df>0] # values greater than 0

                   A       B         C         D
2022-01-01       NaN     NaN  1.974426  2.502181
2022-01-02  0.649916     NaN       NaN  0.611396
2022-01-03  1.916040     NaN  0.191226  0.726365
2022-01-04  1.240771     NaN       NaN  0.288054
2022-01-05       NaN  0.5717  0.322663  1.700305
2022-01-06       NaN     NaN  0.741622  0.048412

In [32]:
df2=df.copy()

#### Adding or cocatenation of column

In [33]:
df2["haris"]=["one","two","three","four","six","eight"]
df2

                   A         B         C         D  haris
2022-01-01 -0.888522 -1.946848  1.974426  2.502181    one
2022-01-02  0.649916 -0.780348 -0.656050  0.611396    two
2022-01-03  1.916040 -0.016785  0.191226  0.726365  three
2022-01-04  1.240771 -0.932199 -0.240157  0.288054   four
2022-01-05 -0.973054  0.571700  0.322663  1.700305    six
2022-01-06 -1.483692 -0.799128  0.741622  0.048412  eight

In [34]:
df2["mean"]=[1.2,2.3,4.5,6.7,8.9,9.0]
df2

                   A         B         C         D  haris  mean
2022-01-01 -0.888522 -1.946848  1.974426  2.502181    one   1.2
2022-01-02  0.649916 -0.780348 -0.656050  0.611396    two   2.3
2022-01-03  1.916040 -0.016785  0.191226  0.726365  three   4.5
2022-01-04  1.240771 -0.932199 -0.240157  0.288054   four   6.7
2022-01-05 -0.973054  0.571700  0.322663  1.700305    six   8.9
2022-01-06 -1.483692 -0.799128  0.741622  0.048412  eight   9.0

In [35]:
df2["new"]=[1,2,3,4,6,6]
df2=df2.iloc[:,0:3]
df2

                   A         B         C
2022-01-01 -0.888522 -1.946848  1.974426
2022-01-02  0.649916 -0.780348 -0.656050
2022-01-03  1.916040 -0.016785  0.191226
2022-01-04  1.240771 -0.932199 -0.240157
2022-01-05 -0.973054  0.571700  0.322663
2022-01-06 -1.483692 -0.799128  0.741622